app/Http/Controllers/CategoriesController.php

select * from `categories` where `categories`.`id` in (2)
select * from `users` where `users`.`id` in (1, 2, 5, 6, 7, 8, 9, 10)
---
    public function show(Category $category, Request $request, Topic $topic,User $user){
        $topics = $topic->withOrder($request->order)
                        ->where('category_id',$category->id)
                        ->with('user','category')
                        ->paginate(20);