app/Http/Controllers/CategoriesController.php

select * from `topics` where `category_id` = 2 order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `topics` where `category_id` = 2
---
    public function show(Category $category){
        $topics = Topic::where('category_id',$category->id)->paginate(20);