app/Http/Controllers/RepliesController.php

insert into `replies` (`content`, `user_id`, `topic_id`, `updated_at`, `created_at`) values ('11223213', 1, '70', '2020-03-08 12:00:43', '2020-03-08 12:00:43')
---
    public function store(ReplyRequest $request, Reply $reply){
        // $data = $request->all();
        $reply->content = $request->content;
        $reply->user_id = Auth::id();
        $reply->topic_id = $request->topic_id;
        $reply->save();