app/Http/Controllers/TopicsController.php

    public function index(Request $request,Topic $topic,User $user){
        $topics = $topic->withOrder($request->order)
                        ->with('user','category') //laravel预加载
                        ->paginate(20);
---
select * from `categories` where `categories`.`id` in (1, 2, 3, 4)
select * from `users` where `users`.`id` in (1, 2, 3, 4, 7, 8, 9, 10)