app/Models/Topic.php

    public function updateReplyCount()
    {
        $this->reply_count = $this->replies->count();
        $this->save();
---
update `topics` set `reply_count` = 8, `excerpt` = 'Corrupti velit et aliquam ipsam eum. Quidem dicta totam deleniti vero. Et ipsum ipsa excepturi dicta similique.', `topics`.`updated_at` = '2020-03-08 12:00:43' where `id` = 70