app/Models/User.php

update `users` set `notification_count` = `notification_count` + 1, `users`.`updated_at` = '2020-03-08 12:00:43' where `id` = 9
---
    public function notify($instance)
    {
        // 如果要通知的人是当前用户，就不必通知了！
        if ($this->id == Auth::id()) {
            return;
        }

        // 只有数据库类型通知才需提醒，直接发送 Email 或者其他的都 Pass
        if (method_exists($instance, 'toDatabase')) {
            $this->increment('notification_count');