app/Models/Traits/ActiveUserHelper.php

select user_id, count(*) as topic_count from `topics` where `created_at` >= '2020-03-01 12:00:27' group by `user_id`
---
    private function calculateTopicScore()
    {
        // 从话题数据表里取出限定时间范围（$pass_days）内，有发表过话题的用户
        // 并且同时取出用户此段时间内发布话题的数量
        $topic_users = Topic::query()->select(DB::raw('user_id, count(*) as topic_count'))
                                     ->where('created_at', '>=', Carbon::now()->subDays($this->pass_days))
                                     ->groupBy('user_id')
                                     ->get();

select user_id, count(*) as reply_count from `replies` where `created_at` >= '2020-03-01 12:00:27' group by `user_id`
---
    private function calculateReplyScore(){
        // 从回复数据表里取出限定时间范围（$pass_days）内，有发表过回复的用户
        // 并且同时取出用户此段时间内发布回复的数量
        $reply_users = Reply::query()->select(DB::raw('user_id, count(*) as reply_count'))
                                     ->where('created_at', '>=', Carbon::now()
                                     ->subDays($this->pass_days))
                                     ->groupBy('user_id')
                                     ->get();