app/Jobs/TranslateSlug.php

update `topics` set `slug` = 'dolorem-itaque-porro-nam-atque' where `id` = 70
---
    public function handle()
    {
        //请求百度api
        $slug = app(SlugTranslateHandler::class)->translate($this->topic->title);

        \DB::table('topics')->where('id', $this->topic->id)->update(['slug' => $slug]);